source : https://leetcode.com/studyplan/30-days-of-pandas/

In [1]:
import numpy as np
import pandas as pd

# Data Manipulation

## 177. Nth Highest Salary

In [2]:
# Input Data
employee = pd.DataFrame({'id':[1, 2, 3], 'salary':[100, 200, 300]})
N = 2

In [3]:
# My Solution
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    drop_salary = employee.drop_duplicates('salary')

    sort_salary = drop_salary.sort_values('salary')[::-1].reset_index()

    if (N > len(sort_salary)) or (N < 1) :
        df_value = np.NaN
    else :
        df_value = sort_salary['salary'].iloc[N-1]

    return pd.DataFrame({f"getNthHighestSalary({N})":[df_value]})

nth_highest_salary(employee, 2)

   getNthHighestSalary(2)
0                     200

## 176. Second Highest Salary

In [4]:
# Input Data
employee = pd.DataFrame({'id':[1, 2, 3], 'salary':[100, 200, 300]})

In [5]:
# My Solution
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    drop_salary = employee.drop_duplicates('salary')

    sort_salary = drop_salary.sort_values('salary')[::-1].reset_index()

    if len(sort_salary) < 2 :
        df_value = np.NaN
    else :
        df_value = sort_salary['salary'].iloc[1]

    return pd.DataFrame({"SecondHighestSalary":[df_value]})

second_highest_salary(employee)

   SecondHighestSalary
0                  200

## 184. Department Highest Salary

In [6]:
# Input Data
employee = pd.DataFrame({'id':[1, 2, 3, 4, 5],
                           'name':['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
                           'salary':[70000, 90000, 80000, 60000, 90000],
                           'departmentId':[1, 1, 2, 2, 1]})
department = pd.DataFrame({'id':[1, 2], 'name':['IT', 'Sales']})

In [9]:
# My Solution
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    department.columns = ['departmentId', 'department_name']
    total_info = pd.merge(left=employee, right=department, how='left', on='departmentId')
    total_info['max_judge'] = np.zeros((total_info.shape[0], 1), dtype=int)

    max_salary = [[x, total_info[total_info['departmentId']==x]['salary'].max()] for x in total_info['departmentId'].unique()]

    for i in max_salary:
        for j in range(len(total_info)):
            if (total_info.loc[j, 'salary'] == i[1]) & (total_info.loc[j, 'departmentId'] == i[0]):
                total_info.loc[j, 'max_judge'] = 1

    result_df = total_info[['department_name', 'name', 'salary']][total_info['max_judge']==1]
    result_df.columns = ['Department', 'Employee', 'Salary']

    return result_df

department_highest_salary(employee, department)

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

In [10]:
# Referenced Solution
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    department.columns = ['departmentId', 'department_name']
    total_info = pd.merge(left=employee, right=department, how='left', on='departmentId')

    max_salary_df = total_info.groupby('departmentId').apply(lambda x: x[x['salary']==x['salary'].max()])

    max_salary_df.reset_index(drop=True, inplace=True)
    max_salary_df.sort_values('id', inplace=True)

    result_df = max_salary_df[['department_name', 'name', 'salary']]
    result_df.columns = ['Department', 'Employee', 'Salary']

    return result_df

department_highest_salary(employee, department)

  Department Employee  Salary
0         IT      Jim   90000
2      Sales    Henry   80000
1         IT      Max   90000

## 178. Rank Scores

In [11]:
# Input Data
scores = pd.DataFrame({'id':[1, 2, 3, 4, 5, 6],
                       'score':[3.50, 3.65, 4.00, 3.85, 4.00, 3.65]})

In [12]:
# My Solution
def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    rank_df = scores[['score']].drop_duplicates()
    rank_df['rank'] = rank_df['score'].rank(ascending=False).astype(int)

    result_df = pd.merge(left=scores, right=rank_df, how='left', on='score', sort=True)[::-1]

    return result_df[['score', 'rank']]

order_scores(scores)

   score  rank
5   4.00     1
4   4.00     1
3   3.85     2
2   3.65     3
1   3.65     3
0   3.50     4

## 196. Delete Duplicate Emails

In [13]:
# Input Data
person = pd.DataFrame({'id': [1, 2, 3],
                       'email': ['john@example.com', 'bob@example.com', 'john@example.com']})

In [17]:
# My Solution
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values('id', inplace=True)
    person.drop_duplicates('email', inplace=True)
    
    return person

delete_duplicate_emails(person)

   id             email
0   1  john@example.com
1   2   bob@example.com

## 1795. Rearrange Products Table

In [19]:
# Input Data
products = pd.DataFrame({'product_id':[0, 1], 'store1':[95, 70], 'store2':[100, np.nan], 'store3':[105, 80]})

In [20]:
# My Solution
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    for i in products.columns[1:]:
        globals()[i] = products[['product_id', i]].copy()    # globals()[x] : 문자열 x를 변수로 할당하는 함수
        globals()[i].rename({i:'price'}, axis=1, inplace=True)
        globals()[i]['store'] = i

    total_df = pd.concat([globals()[x] for x in products.columns[1:]])
    total_df.dropna(inplace=True)
    total_df.sort_values(['product_id', 'price'], inplace=True)

    return total_df[['product_id', 'store', 'price']]

rearrange_products_table(products)

   product_id   store  price
0           0  store1   95.0
0           0  store2  100.0
0           0  store3  105.0
1           1  store1   70.0
1           1  store3   80.0

# Statistics

## 1907. Count Salary Categories

In [22]:
# Input Data
accounts = pd.DataFrame({'account_id':[3, 2, 8, 6], 'income':[108939, 12747, 87709, 91796]})

In [23]:
# My Solution
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    accounts['category'] = accounts['income'].apply(lambda x: 'Low Salary' if x < 20000 else 'Average Salary' if x <= 50000 else 'High Salary')
    result = pd.DataFrame({
        'category': ['Low Salary', 'Average Salary', 'High Salary'],
        'accounts_count': [
            accounts['category'][accounts['category']=='Low Salary'].count(),
            accounts['category'][accounts['category']=='Average Salary'].count(),
            accounts['category'][accounts['category']=='High Salary'].count()
            ]
        })

    return result

count_salary_categories(accounts)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

In [25]:
# Referenced Solution
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    result = pd.DataFrame({
        'category': ['Low Salary', 'Average Salary', 'High Salary'],
        'accounts_count': [
            accounts[accounts['income'] < 20000].shape[0],
            accounts[(accounts['income'] >= 20000) & (accounts['income'] <= 50000)].shape[0],
            accounts[accounts['income'] > 50000].shape[0]
        ]
    })

    return result

count_salary_categories(accounts)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3